[
  {
    "title": "DevFest 2024 Ranchi",
    "about": "This years DevFest explores how AI can be responsibly developed or applied to keep its users safe, from business to healthcare to education. We acknowledge AIs potential while also recognizing the challenges it presents.",
    "description": "Dont miss this incredible opportunity to expand your knowledge and network with industry leaders. Gain valuable insights from expert talks, join networking opportunities, participate in hands-on workshops, explore startup demos and solutions, and enjoy exciting giveaways and prizes. Key themes include Responsible AI, Cloud, Mobile, Flutter, TensorFlow, Gemini, Gemma, and more.",
    "date": "October 19, 2024",
    "time": "9:00 AM -- 5:00 PM GMT530",
    "location": "Jharkhand University of Technology, Science Technology Campus, Sirkha Toli, Kali Nagar, Namkum, Ranchi, Barganwa, Jharkhand 834010, Ranchi, 834010",
    "institute": "Jharkhand University of Technology",
    "slug": "devfest-2024-ranchi-october-19-2024-jharkhand-university-of-technology"
  },
  {
    "title": "UIUX Arena",
    "about": "Step into the world of UIUX and bring your lively ideas into action! In collaboration with EDC, Google Developer Group Ranchi brings you an electrifying event UIUX Arena where you can collaborate, innovate and create stunning designs and showcase your creative genius. Lets redefine the art of user experience.",
    "description": "UIUX Arena is a thrilling event designed to test your creativity and problem-solving skills in design. The competition has two stages a quiz to challenge theoretical knowledge and a hands-on design task to showcase practical skills. Guidelines include team sign-up, elimination in round 1 quiz, and design challenge in round 2 using Figma without AI features. Prizes include INR 10K Google Developer Group goodies.",
    "date": "January 26 -- February 2, 2025",
    "time": "6:27 AM -- 5:00 PM GMT530",
    "location": "Birla Institute of Technology - Mesra, LH1 LH2, Mesra, 835215",
    "institute": "Birla Institute of Technology - Mesra",
    "slug": "uiux-arena-january-26-february-2-2025-birla-institute-of-technology-mesra",
    "images": [
    "/images/uiuxArena/uiux (1).jpg",
    "/images/uiuxArena/uiux (2).jpg",
    "/images/uiuxArena/uiux (3).jpg"
  ]
  },
  {
    "title": "Build With AI Code, Create Innovate!",
    "about": "Google Developer Group Ranchi, in collaboration with Women Tech Makers, is hosting a Build with AI 2025 event to celebrate, educate, and inspire in tech through impactful talks, panel discussions, and networking sessions.",
    "description": "Join GDG Ranchi for an exciting hands-on workshop as part of Build with AI 2025! Dive into Generative AI with Gemini models, leverage Firebase for seamless app integration, explore Vertex AI for model deployment, and implement Vector Search for intelligent data retrieval. This workshop is designed for developers of all skill levels, offering practical insights into building AI-powered applications with Googles cutting-edge technologies. Build with AI events are community-led, hands-on activities aimed to help developers acquire and apply Generative AI skills using the latest Google AI tools and models. The agenda includes leveraging Gemma for RAG-based application development, break and networking sessions, and interactive quizzes with prize giveaways.",
    "date": "March 29, 2025",
    "time": "9:00 AM -- 4:00 PM GMT530",
    "location": "Indian Institute of Information Technology Ranchi, P.O. Hazaribagh Road, Getlatu, 835217",
    "institute": "Indian Institute of Information Technology Ranchi",
    "slug": "build-with-ai-code-create-innovate-march-29-2025-indian-institute-of-information-technology-ranchi",
    "images": [
    "/images/BuildWithAI-IIIT-Ranchi/BWAI-IIIT-Ranchi (1).jpg",
    "/images/BuildWithAI-IIIT-Ranchi/BWAI-IIIT-Ranchi (2).jpg",
    "/images/BuildWithAI-IIIT-Ranchi/BWAI-IIIT-Ranchi (3).jpg"
  ]
  },
  {
    "title": "Build With AI HackHorizon -- Where Innovation Meets Reality!",
    "about": "GDG Ranchi is thrilled to host Build with AI, featuring expert talks and discussions on the latest advancements in AI and Cloud technologies...",
    "description": "The event will showcase Next-Gen Modernization with sessions on Generative AI, Kubernetes, and Google Cloud in Action, covering AI-assisted code refactoring, containerization, and building scalable, intelligent, and cloud-native solutions. An outstanding networking opportunity with industry professionals is included. As part of the event, Arka Jain University in collaboration with GDG Ranchi and other partners will host Hack Horizon, a hackathon where participants solve real-world challenges. The event is invite-only, and shortlisted participants will be notified by email.",
    "date": "April 11, 2025",
    "time": "10:00 AM -- 5:00 PM GMT530",
    "location": "ARKA JAIN University, Mohanpur, Gamharia, Mohanpur, 832108",
    "institute": "ARKA JAIN University",
    "slug": "build-with-ai-hackhorizon-where-innovation-meets-reality-april-11-2025-arka-jain-university",
    "images": [
    "/images/BuildWithAI-ArkaJainUniversity/BWAI-ArkaJain (1).jpeg",
    "/images/BuildWithAI-ArkaJainUniversity/BWAI-ArkaJain (2).jpg",
    "/images/BuildWithAI-ArkaJainUniversity/BWAI-ArkaJain (3).jpeg",
    "/images/BuildWithAI-ArkaJainUniversity/BWAI-ArkaJain (4).jpeg"
  ]
  },
  {
    "title": "Understanding Cybersecurity in the age of Generative AI",
    "about": "Organized by GDG Ranchi in collaboration with Usha Martin University, this event focuses on the security challenges arising with the rapid adoption of Generative AI technologies. Attendees will explore the dark side of Gen AI including prompt injections, jailbreaking, and advanced AI exploits.",
    "description": "While developers create magic with AI, attackers are finding new ways to break it. This session dives deep into real Gen AI security threats and how to tackle them, offering insights from a seasoned AI expert, Nikhilesh, IIT Kharagpur alumnus and Google Developer Expert. Participants will learn about AI vulnerabilities and network with fellow tech enthusiasts to build AI that is not just smart but also secure.",
    "date": "May 9, 2025",
    "time": "11:15 AM -- 12:30 PM GMT530",
    "location": "Usha Martin University, Village Narayansoso, Near Angara Block Office, Ranchi - Purulia Highway, Angara, Ranchi - 835103, Jharkhand, Ranchi, 835103",
    "institute": "Usha Martin University",
    "slug": "understanding-cybersecurity-in-the-age-of-generative-ai-may-9-2025-usha-martin-university",
    "images": [
    "/images/UshaMartin-Cybersecurity/UshaMartin-Cybersec (1).jpg",
    "/images/UshaMartin-Cybersecurity/UshaMartin-Cybersec (2).jpg",
    "/images/UshaMartin-Cybersecurity/UshaMartin-Cybersec (3).jpg",
    "/images/UshaMartin-Cybersecurity/UshaMartin-Cybersec (4).jpg",
    "/images/UshaMartin-Cybersecurity/UshaMartin-Cybersec (5).jpg"
  ]
},
{
  "title": "Build with AI Workshop Edition",
  "about": "Get ready for a power-packed tech workshop where ideas meet innovation! Whether youre a tech enthusiast, a future entrepreneur, or an AI-curious mind --- this event is your launchpad to the next big thing. Organized by Xavier TechByte Society, Department of Computer Science, St. Xaviers College Ranchi in collaboration with GDG Ranchi.",
  "description": "Exclusive for St. Xaviers College students, this event offers hands-on AI Cloud workshop sessions for learning by doing, live demos and practical building exercises, free cloud credits to kickstart AICloud projects, inspiring sessions from real-world tech experts, actionable strategies for learning, building, and scaling, and networking with like-minded tech enthusiasts. The event encourages understanding local innovation and balancing studies with tech pursuits.",
  "date": "May 10, 2025",
  "time": "10:00 AM -- 3:00 PM GMT530",
  "location": "St. Xaviers College, Ranchi, Doctor Camil Bulcke Path, Ranchi, 834001",
  "institute": "St. Xaviers College",
  "slug": "build-with-ai-workshop-edition-may-10-2025-st-xaviers-college",
  "images": [
  "/images/Build-with-AI-Workshop-Edition-St-XavierCollege/BwAI-Workshop-XavierCollege (1).jpg",
  "/images/Build-with-AI-Workshop-Edition-St-XavierCollege/BwAI-Workshop-XavierCollege (2).jpg",
  "/images/Build-with-AI-Workshop-Edition-St-XavierCollege/BwAI-Workshop-XavierCollege (3).jpg",
  "/images/Build-with-AI-Workshop-Edition-St-XavierCollege/BwAI-Workshop-XavierCollege (4).jpg",
  "/images/Build-with-AI-Workshop-Edition-St-XavierCollege/BwAI-Workshop-XavierCollege (5).png"
  ]
  },
  {
    "title": "National Symposium on Mathematical Innovations and Its Industrial Applications NSMIIA 2025",
    "about": "This three-day symposium brought together academic and industry experts for insightful talks and panel discussions on the latest innovations in mathematics and their real-world industrial applications...",
    "description": "We organized plenary talks by renowned experts, panel discussions, and networking opportunities. The event included the biggest math exhibition of the year called MATRIX 2025---a competitive and exciting showcase where participants brought math-rich, industry-relevant models, innovative algorithms, tech-driven solutions, and research that can transform industries. Participants shared ideas bridging theory with practical impact, received exciting prizes, certificates, and recognition.",
    "date": "August 8--10, 2025",
    "time": "",
    "location": "Department of Mathematics, Birla Institute of Technology BIT Mesra, Ranchi, Jharkhand, India",
    "institute": "Birla Institute of Technology BIT Mesra",
    "slug": "national-symposium-on-mathematical-innovations-and-its-industrial-applications-nsmiia-2025-august-8-10-2025-birla-institute-of-technology-bit-mesra"
  },
  {
    "title": "Wire to Web Hands on WebDev Workshop",
    "about": "Wire to Web is a beginner-friendly, hands-on web development workshop where youll learn to build and deploy real websites from scratch! The workshop covers HTML, CSS, JavaScript, backend basics, and hosting with Google Cloud, all live on MS Teams.",
    "description": "The session starts with an introduction to frontend, backend, and full-stack roles with tools like VS Code and GitHub. It includes live coding demos for building styled interactive web pages, backend development basics with Node.js, APIs, databases, and hosting projects on GitHub Pages and Google Cloud free tier. Participants get a guided learning path from HTML to React and backend, insights into Google Ecosystem resources, and interactive QA with portfolio reviews. All attendees receive certificates.",
    "date": "June 12, 2025",
    "time": "4:45 PM -- 7:00 PM GMT530",
    "location": "Online via MS Teams",
    "institute": "",
    "slug": "wire-to-web-hands-on-webdev-workshop-june-12-2025"
  },
  {
    "title": "GDG Ranchis Summer TrainingInternship Program 2025",
    "about": "Registrations Open! Get ready to kickstart your tech journey with GDG Ranchis Summer TrainingInternship Program 2025 in collaboration with Piyush Academy! Open to all -- No experience needed, just passion consistency!",
    "description": "Learn Full-Stack Web Development HTML, CSS, JS, React, Node.js, MongoDB, Google Cloud Firebase, GCP, Compute Engine, daily tasks, weekend projects, live deployment, mentorship, swags, spotlight, and internship certificate from GDG Ranchi. Capstone showcase to industry experts included.",
    "date": "June 14 -- July 19, 2025",
    "time": "",
    "location": "Hybrid Online Offline",
    "institute": "",
    "slug": "gdg-ranchis-summer-traininginternship-program-2025-june-14-july-19-2025"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25-- NIAMT",
    "about": "Join Google Developer Groups Ranchi for DevSpark at National Institute of Advanced Manufacturing Technology --- a pre-hype event for the highly anticipated DevFest 2025! This event is a sneak peek designed to spark excitement and give a taste of the bigger festival ahead.",
    "description": "Explore the latest trends in AI and Cloud development, gain hands-on exposure to real-world applications, receive cloud credits with guided training to explore Google Cloud, and participate in quiz sessions with winners getting exclusive free passes to DevFest 2025 Ranchi. Network with tech leaders and peers. DevSpark ignites the energy before DevFest sets it on fire.",
    "date": "August 30, 2025",
    "time": "10:00 AM -- 10:0 PM GMT530",
    "location": "NIAMT Ranchi Main Gate, NIFFT Gate to B-Tech Hostel, Ranchi, 834003",
    "institute": "NIAMT Ranchi",
    "slug": "devspark-pre-hype-devfest25-niamt-august-30-2025-niamt-ranchi"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- REC",
    "about": "Join Google Developer Groups Ranchi for DevSpark at Ramgarh Engineering College in collaboration with Aarambh Community of Ramgarh Engineering College --- a pre-hype event leading up to DevFest 2025.",
    "description": "This event offers a chance to explore the latest trends in AI and Cloud development. Attendees can get hands-on exposure to real-world applications, receive cloud credits with guided training to explore Google Cloud practically, and participate in quiz sessions where winners earn exclusive free passes to DevFest 2025 Ranchi. The event aims to boost skills and foster community growth among passionate tech enthusiasts. DevSpark ignites the energy before DevFest sets it on fire.",
    "date": "September 2, 2025",
    "time": "11:00 AM -- 12:30 PM GMT530",
    "location": "Ramgarh Engineering College, Seminar Hall, Murubanda, 825101",
    "institute": "Ramgarh Engineering College",
    "slug": "devspark-pre-hype-devfest25-rec-september-2-2025-ramgarh-engineering-college"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- RVS",
    "about": "Join Google Developer Groups Ranchi for DevSpark at RVS College Of Engineering and Technology in collaboration with Helix Club of RVS College Of Engineering and Technology --- a pre-hype event for the highly anticipated DevFest 2025!",
    "description": "This event is your opportunity to dive into the latest trends in AI and Cloud development. It serves as a sneak peek designed to spark excitement and give participants a taste of the bigger festival ahead. Attendees will explore the latest tools, technologies, and innovations, gain hands-on exposure to real-world applications, receive cloud credits with guided training for Google Cloud, participate in quiz sessions where winners get exclusive free passes to DevFest 2025 Ranchi, and connect with tech leaders and like-minded peers. DevSpark ignites the energy, setting the stage for DevFest.",
    "date": "September 4, 2025",
    "time": "9:30 AM -- 11:30 AM GMT530",
    "location": "RVS College Of Engineering And Technology, Jamshedpur, Seminar Hall, Idalbera, 831012",
    "institute": "RVS College Of Engineering And Technology",
    "slug": "devspark-pre-hype-devfest25-rvs-september-4-2025-rvs-college-of-engineering-and-technology"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- IIT Dhanbad",
    "about": "Join Google Developer Groups Ranchi for DevSpark at IITISM Dhanbad in collaboration with CyberLabs --- a pre-hype event for the highly anticipated DevFest 2025!",
    "description": "This event offers a chance to explore the latest trends in AI and Cloud development. Attendees gain hands-on exposure to real-world applications, receive cloud credits with guided Google Cloud training, and participate in quiz sessions with winners receiving exclusive free passes to DevFest 2025 Ranchi. The event provides opportunities to connect with tech leaders and like-minded peers. DevSpark ignites excitement leading up to the main DevFest event.",
    "date": "September 6, 2025",
    "time": "1:30 PM -- 3:30 PM GMT530",
    "location": "Seminar Hall in New Academic Complex NAC, IIT Dhanbad Internal Road, Dhanbad, 826007",
    "institute": "IIT Dhanbad",
    "slug": "devspark-pre-hype-devfest25-iit-dhanbad-september-6-2025-iit-dhanbad"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- DSPMU",
    "about": "Join Google Developer Groups Ranchi for DevSpark at DSPMU in collaboration with Coders Hub DSPMU --- a pre-hype event for the highly anticipated DevFest 2025!",
    "description": "This event is an opportunity to explore the latest trends in AI and Cloud development. Attendees get hands-on exposure to real-world applications, cloud credits with guided Google Cloud training, and quiz sessions where winners receive exclusive free passes to DevFest 2025 Ranchi. It is designed to boost skills and foster growth among passionate tech enthusiasts. DevSpark ignites energy ahead of DevFest.",
    "date": "September 11, 2025",
    "time": "10:53 AM -- 1:53 PM GMT530",
    "location": "Dr. Shyama Prasad Mukherjee University, Post, Ranchi, 834008",
    "institute": "Dr. Shyama Prasad Mukherjee University",
    "slug": "devspark-pre-hype-devfest25-dspmu-september-11-2025-dr-shyama-prasad-mukherjee-university"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- JRSU",
    "about": "Join Google Developer Groups Ranchi for DevSpark at Jharkhand Raksha Shakti University --- a pre-hype event for the highly anticipated DevFest 2025!...",
    "description": "This event is an opportunity to dive into the latest trends in AI and Cloud development, designed as a sneak peek to spark excitement for the bigger festival ahead. Attendees can explore the latest tools and innovations, gain hands-on exposure to real-world applications, receive cloud credits with guided Google Cloud training, participate in quiz sessions where winners get exclusive free passes to DevFest 2025 Ranchi, and network with tech leaders and peers. DevSpark ignites energy leading up to the DevFest main event.",
    "date": "September 12, 2025",
    "time": "1:30 PM -- 3:00 PM GMT530",
    "location": "Jharkhand Raksha Shakti University, Meurs Road, Ranchi, 834008",
    "institute": "Jharkhand Raksha Shakti University",
    "slug": "devspark-pre-hype-devfest25-jrsu-september-12-2025-jharkhand-raksha-shakti-university"
  },
  {
    "title": "DevSpark Pre-Hype DevFest25 -- BIT Devghar",
    "about": "Join Google Developer Groups Ranchi for DevSpark at BIT Deoghar in collaboration with IEEE Society --- a pre-hype event for the highly anticipated DevFest 2025!",
    "description": "This event offers a chance to explore the latest trends in AI and Cloud development as a sneak peek for the bigger festival ahead. Attendees will explore the latest tools and innovations, gain hands-on exposure to real-world applications, receive cloud credits with guided training to explore Google Cloud, participate in quiz sessions where winners get exclusive free passes to DevFest 2025 Ranchi, and connect with tech leaders and like-minded peers. DevSpark ignites the energy, setting the stage for DevFest.",
    "date": "September 13, 2025",
    "time": "10:00 AM -- 11:30 AM GMT530",
    "location": "Birla Institute of Technology Deoghar, Seminar Hall, Jasidih, 814142",
    "institute": "Birla Institute of Technology Deoghar",
    "slug": "devspark-pre-hype-devfest25-bit-devghar-september-13-2025-birla-institute-of-technology-deoghar"
  }
]
